---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchingInTheWrongView
source: html/2b096574-b9ba-f990-9243-9450294d0bc5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchingInTheWrongView Property

Detail sketch is only editable in [View Type].

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchingInTheWrongView { get; }
```